## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/15018176453)



<pre><code>Error: Error creating Repository: googleapi: Error 400: An error occurred while retrieving upstream credentials: invalid secret version &#34;docker_sap_org_service_auth_token&#34;. Must be in the format of &#34;projects/{project}/secrets/{secret}/versions/{version}&#34;: invalid argument

  with module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0],
  on ../../modules/artifact-registry/main.tf line 81, in resource &#34;google_artifact_registry_repository&#34; &#34;unprotected_repository&#34;:
  81: resource &#34;google_artifact_registry_repository&#34; &#34;unprotected_repository&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.kubectl_file_documents.automated_approver_rules: Reading...
data.kubectl_file_documents.automated_approver: Reading...
data.kubectl_file_documents.automated_approver_rules: Read complete after 0s [id=bf70e95238af237c504895dc5a1fda764e0501d635c5fc67d0a39fd3208dc85d]
data.kubectl_file_documents.automated_approver: Read complete after 0s [id=3d2696322cc13434c2784575d5ca625e1dc57d80c62952f9cba90d8680708e1f]
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Reading...
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
data.github_organization.kyma-project: Reading...
data.github_repository.test_infra: Reading...
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
google_artifact_registry_repository.docker_cache: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.docker_cache.data.google_client_config.this: Reading...
google_artifact_registry_repository_iam_member.dockerhub_mirror_access: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_artifact_registry_repository.dev_modules_internal: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-modules-internal]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
google_service_account.kyma_project_kyma_submission_pipeline: Refreshing state... [id=projects/kyma-project/serviceAccounts/kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_modules.data.google_client_config.this: Reading...
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 1s [id=test-infra]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
google_artifact_registry_repository.dockerhub_mirror: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Reading...
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
google_service_account.sa-prow-deploy: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-prow-deploy@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
google_service_account.gencred-refresher: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gencred-refresher@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
google_service_account.sa-gcs-plank: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gcs-plank@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
google_service_account.secret-manager-trusted: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secret-manager-trusted@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
google_service_account.sa-gcr-kyma-project-trusted: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gcr-kyma-project-trusted@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.counduit-cli-bucket: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/counduit-cli-bucket@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-prowjob-gcp-logging-client: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-prowjob-gcp-logging-client@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-prow-pubsub: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-prow-pubsub@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.test_infra: Read complete after 2s [id=test-infra]
google_service_account.secret-manager-untrusted: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secret-manager-untrusted@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Reading...
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
google_service_account.kyma-compliance-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-compliance-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.control-plane: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/control-plane@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Reading...
google_service_account.sa-kyma-artifacts: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-artifacts@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.firebase-adminsdk-udzxq: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/firebase-adminsdk-udzxq@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.secret-manager-prow: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secret-manager-prow@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
google_service_account.sa-vm-kyma-integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-vm-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-gke-kyma-integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.dev_modules_internal_repo_admin: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-modules-internal/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
github_actions_organization_variable.image_syncer_reader_service_account_email: Refreshing state... [id=IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL]
data.google_container_cluster.prow_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
github_actions_organization_variable.image_syncer_writer_service_account_email: Refreshing state... [id=IMAGE_SYNCER_WRITER_SERVICE_ACCOUNT_EMAIL]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/5685251492968365145]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.kyma_autobump_bot_github_token_secret_name: Refreshing state... [id=test-infra:KYMA_AUTOBUMP_BOT_GITHUB_SECRET_NAME]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.service_account_keys_r

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 not in configuration)
  - resource "google_artifact_registry_repository" "dockerhub_mirror" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2024-10-31T09:26:30.153692Z" -> null
      - description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md" -> null
      - effective_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror" -> null
      - labels                 = {} -> null
      - location               = "europe" -> null
      - mode                   = "REMOTE_REPOSITORY" -> null
      - name                   = "dockerhub-mirror" -> null
      - project                = "sap-kyma-prow" -> null
      - repository_id          = "dockerhub-mirror" -> null
      - terraform_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - update_time            = "2024-10-31T09:26:30.153692Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "cleanup-old-images" -> null

          - condition {
              - older_than            = "63072000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - remote_repository_config {
          - description                 = "Mirror of Docker Hub" -> null
          - disable_upstream_validation = false -> null

          - docker_repository {
              - public_repository = "DOCKER_HUB" -> null
            }
        }
    }

  # google_artifact_registry_repository_iam_member.dockerhub_mirror_access will be destroyed
  # (because google_artifact_registry_repository_iam_member.dockerhub_mirror_access is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "dockerhub_mirror_access" {
      - etag       = "BwYyZ9m2VqA=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has moved to module.artifact_registry["modules-internal"].google_artifact_registry_repository.protected_repository[0]
    resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev_docker_repository.google_artifact_registry_repository.artifact_registry has moved to module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]
    resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry will be destroyed
  # (because google_artifact_registry_repository.artifact_registry is not in configuration)
  - resource "google_artifact_registry_repository" "artifact_registry" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2025-04-15T09:00:37.678076Z" -> null
      - description            = "Development Kyma modules" -> null
      - effective_labels       = {
          - "goog-terraform-provisioned" = "true"
          - "name"                       = "dev-kyma-modules"
          - "owner"                      = "neighbors"
          - "type"                       = "development"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules" -> null
      - labels                 = {
          - "name"  = "dev-kyma-modules"
          - "owner" = "neighbors"
          - "type"  = "development"
        } -> null
      - location               = "europe" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "dev-kyma-modules" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "dev-kyma-modules" -> null
      - terraform_labels       = {
          - "goog-terraform-provisioned" = "true"
          - "name"                       = "dev-kyma-modules"
          - "owner"                      = "neighbors"
          - "type"                       = "development"
        } -> null
      - update_time            = "2025-05-05T13:33:05.257007Z" -> null

      - docker_config {
          - immutable_tags = false -> null
        }
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0] will be created
  + resource "google_artifact_registry_repository" "unprotected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Development Kyma modules"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev-kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dev-kyma-modules"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dev-kyma-modules"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dev-kyma-modules"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"] must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      ~ etag       = "BwYyzWe096I=" -> (known after apply)
      ~ id         = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com" -> (known after apply)
      ~ repository = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] will be created
  + resource "google_artifact_registry_repository" "unprotected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Cache repo for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "cache"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "cache"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + older_than            = "3600s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-cache"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] will be created
  + resource "google_artifact_registry_repository" "unprotected_repository" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dockerhub-mirror"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dockerhub-mirror"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + remote_repository_config {
          + description = "Remote repository mirroring Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "docker_sap_org_service_auth_token"
                  + username                = "sapcom"
                }
            }
        }
    }

  # module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

  # module.kyma_modules.google_artifact_registry_repository.artifact_registry has moved to module.kyma_modules.google_artifact_registry_repository.protected_repository[0]
    resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/kyma-modules"
        name                   = "kyma-modules"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] will be updated in-place
  # (moved from module.prod_docker_repository.google_artifact_registry_repository.artifact_registry)
  ~ resource "google_artifact_registry_repository" "protected_repository" {
      ~ effective_labels       = {
          ~ "type"  = "production" -> "development"
            # (2 unchanged elements hidden)
        }
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
      ~ labels                 = {
          ~ "type"  = "production" -> "development"
            # (2 unchanged elements hidden)
        }
        name                   = "prod"
      ~ terraform_labels       = {
          ~ "type"  = "production" -> "development"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-05-06T14:04:03.413143Z" -> "2025-05-13T13:19:15.767591Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
google_artifact_registry_repository_iam_member.dockerhub_mirror_access: Destroying... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Destroying... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
google_artifact_registry_repository.docker_cache: Destroying... [id=projects/kyma-project/locations/europe/repositories/cache]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Creating...
module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0]: Creating...
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Modifying... [id=projects/kyma-project/locations/europe/repositories/prod]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Modifications complete after 1s [id=projects/kyma-project/locations/europe/repositories/prod]
google_artifact_registry_repository.docker_cache: Destruction complete after 2s
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Destruction complete after 7s
module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry: Destroying... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Creating...
google_artifact_registry_repository_iam_member.dockerhub_mirror_access: Destruction complete after 8s
google_artifact_registry_repository.dockerhub_mirror: Destroying... [id=projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror]
module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry: Destruction complete after 1s
google_artifact_registry_repository.dockerhub_mirror: Destruction complete after 1s
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Still creating... [10s elapsed]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Creation complete after 13s [id=projects/kyma-project/locations/europe/repositories/cache]
module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]: Creating...
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Still creating... [10s elapsed]
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Creation complete after 12s [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Creating...
module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]: Creation complete after 7s [id=projects/kyma-project/locations/europe/repositories/cache/roles/artifactregistry.repoAdmin/serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Creation complete after 7s [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]

Error: Error creating Repository: googleapi: Error 400: An error occurred while retrieving upstream credentials: invalid secret version "docker_sap_org_service_auth_token". Must be in the format of "projects/{project}/secrets/{secret}/versions/{version}": invalid argument

  with module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0],
  on ../../modules/artifact-registry/main.tf line 81, in resource "google_artifact_registry_repository" "unprotected_repository":
  81: resource "google_artifact_registry_repository" "unprotected_repository" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":12929,"Program":"tfcmt","SHA1":"9c25b5bc310e893b25b5498239c8117a4cce09b7","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->